Grooming/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Grooming/src/Enums/ТипыОрганизаций/ТипыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОрганизаций</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Catalogs/Организации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимостьТипОрганизации()
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	УстановитьВидимостьТипОрганизации();
КонецПроцедуры     



&НаКлиенте
Процедура УстановитьВидимостьТипОрганизации()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Если Не Объект.ГлавныйБухгалтер.Пустая() Тогда 
			Объект.ГлавныйБухгалтер = Неопределено;
		КонецЕсли
		
	КонецЕсли
КонецПроцедуры
